#!/bin/bash
PREFIX="/vhs/kangle/ext"
clear
clear
echo -e "
————————————————————————————————————————————————————
Kangle一键脚本-卸载PHP版本
本功能将安全卸载自定义PHP版本
输入 all 卸载所有PHP版本
输入 p52 单独卸载PHP5.2
输入 p53 单独卸载PHP5.3
输入 p54 单独卸载PHP5.4
输入 p55 单独卸载PHP5.5
输入 p56 单独卸载PHP5.6
输入 p70 单独卸载PHP7.0
输入 p71 单独卸载PHP7.1
输入 p72 单独卸载PHP7.2
空白或无效指令输入将退出卸载系统
————————————————————————————————————————————————————"
input_enter=""
read -p "" input_enter
if [ "$input_enter" = "all" ]
	then
	rm -rf $PREFIX/php*
	clear
	 -e "
————————————————————————————————————————————————————
所有PHP已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p52" ]
	then
	rm -rf $PREFIX/tpl_php52
	clear
	echo -e "
————————————————————————————————————————————————————
PHP52已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p53" ]
	then
	rm -rf $PREFIX/php53
	clear
	echo -e "
————————————————————————————————————————————————————
PHP53已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p54" ]
	then
	rm -rf $PREFIX/php54
	clear
	echo -e "
————————————————————————————————————————————————————
PHP54已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p55" ]
	then
	rm -rf $PREFIX/php55
	clear
	echo -e "
————————————————————————————————————————————————————
PHP55已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p56" ]
	then
	rm -rf $PREFIX/php56
	clear
	echo -e "
————————————————————————————————————————————————————
PHP56已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p70" ]
	then
	rm -rf $PREFIX/php70
	clear
	echo -e "
————————————————————————————————————————————————————
PHP7已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p71" ]
	then
	rm -rf $PREFIX/php71
	clear
	echo -e "
————————————————————————————————————————————————————
PHP71已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
elif [ "$input_enter" = "p72" ]
	then
	rm -rf $PREFIX/php72
	clear
	echo -e "
————————————————————————————————————————————————————
PHP72已卸载完毕 如需重装请输入hls
————————————————————————————————————————————————————"
else
	clear
	echo -e "
————————————————————————————————————————————————————
无效指令请重新执行 hls 进入主菜单
————————————————————————————————————————————————————"
fi
